app/controllers/expenses_controller.rb

SELECT * FROM `expenses`
---
  def index
    if current_user
      @date = build_date_from_params(params)
      @categories = current_user.categories
      if params[:category_name].blank?
        @expenses = current_user.expenses_by_year_and_month(:date => @date).sort { |e1, e2| e1.date <=> e2.date }.select {|e| e.amount < 0}

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 953125641)
---
  def show
    @expense = Expense.find(params[:id])

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 953125641)
---
  def edit
    @expense = Expense.find(params[:id])

INSERT INTO `expenses` (`category`, `created_at`, `buoni`, `updated_at`, `amount`, `date`, `bancomat`, `description`, `ufficio`) VALUES(NULL, '2009-07-14 17:12:25', NULL, '2009-07-14 17:12:25', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @expense = Expense.new(params[:expense])
    if @expense.save

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 953125641)
---
  def update
    @expense = Expense.find(params[:id])

SELECT * FROM `expenses` WHERE (`expenses`.`id` = 953125641)
DELETE FROM `expenses` WHERE `id` = 953125641
---
  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy